{
    "experiences": [
        {
            "title": "Student Software Engineer",
            "subtitle": "Climative",
            "workType": "Co-Op / Internship",
            "workDescription": [
                "Integrated **2** new product.",
                "Worked on adding **def** to **bcd**. Improved speed by 50%."
            ],
            "dateText": "January 2023 - April 2023"
        },
        {
            "title": "Associate Engineer",
            "subtitle": "AstraZeneca Pvt. Ltd.",
            "workType": "Full Time",
            "workDescription": [
"• Performance Metrics Generation: Formulated more than 300 metrics relevant to pharmaceutical data through requirement elicitation with stakeholders and product owners.",
"• Intelligent Cubes Generation: Constructed in-memory datasets (Intelligent Cubes) in MicroStrategy for dynamic aggregation and support for derived metrics which resulted in an improvement of 40% for the time taken to render data in the dashboards.",
"• Business Intelligence Development: Engineered dashboards with relevant Key Performance Indicators to assist stakeholders in making informed business decisions and deriving business insights from both historical and realtime data in the order of millions of records.",
"• Data Engineering: Implemented a new content pipeline consisting of multiple data layers using Spark to provision data relevant to pharmaceutical drugs in Amazon S3 buckets.",
"• Job Orchestration: Automated Data Extraction, Transformation and Load (ETL) jobs with Apache Airflow and eliminated manual data deployment tasks by more than 70%."
            ],
            "dateText": "May 2018 – July 2021"
        },
        {
            "title": "Research and Development Intern",
            "subtitle": "Glosys Technology Solutions Pvt. Ltd.",
            "workType": "Undergraduate Internship",
            "workDescription": [
"• Devised a model to calculate optimal inventory volume that should be maintained in healthcare facilities thereby minimizing perishable equipment waste by at least 50%, leveraging Economic Order Quantity mathematical models and Machine Learning algorithms such as Neural Networks.",
"• Developed a web application for Healthcare personnel to maintain optimal inventory levels of perishable products with minimal human intervention, thereby reducing waste by at least 65 %."
            ],
            "dateText": "December 2017 – April 2018"
        }
    ]
}
